Repository: meetrize/macquickfinder
Catalog: Sources/Explorer/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# action.add_favorite
source: Add to Favorites
zh_hans: 收藏

# action.cancel
source: Cancel
zh_hans: 取消

# action.copy
source: Copy
zh_hans: 复制

# action.copy_filename
source: Copy Filename
zh_hans: 复制文件名

# action.copy_paths
source: Copy Full Path
zh_hans: 复制完整路径

# action.cut
source: Cut
zh_hans: 剪切

# action.delete
source: Delete
zh_hans: 删除

# action.delete_immediately
source: Delete Immediately
zh_hans: 立刻删除

# action.edit
source: Edit
zh_hans: 编辑

# action.empty_trash
source: Empty Trash
zh_hans: 清倒废纸篓

# action.ok
source: OK
zh_hans: 好

# action.open
source: Open
zh_hans: 打开

# action.open_in_new_window
source: Open in New Window
zh_hans: 在新窗口中打开

# action.open_terminal_here
source: Open Terminal Here
zh_hans: 在此处打开终端

# action.open_with
source: Open With
zh_hans: 打开方式

# action.open_with_default %@
source: %@ (Default)
zh_hans: %@（默认）

# action.open_with_none
source: (No Available Applications)
zh_hans: （无可用应用）

# action.open_with_other
source: Other…
zh_hans: 其他…

# action.paste
source: Paste
zh_hans: 粘贴

# action.put_back
source: Put Back
zh_hans: 放回原处

# action.remove_favorite
source: Remove from Favorites
zh_hans: 取消收藏

# action.rename
source: Rename
zh_hans: 重命名

# action.refresh
source: Refresh
zh_hans: 刷新

# action.save
source: Save
zh_hans: 保存

# action.services
source: Services
zh_hans: 服务

# action.show_info
source: Get Info
zh_hans: 属性

# alert.confirm_delete.multiple %lld
source: Delete %lld items?
zh_hans: 确认删除 %lld 个项目？

# alert.confirm_delete.single %@
source: Delete "%@"?
zh_hans: 确认删除「%@」？

# alert.delete_immediately.message
source: These items will be permanently deleted and cannot be recovered.
zh_hans: 这些项目将被永久删除，无法恢复。

# alert.delete_immediately.multiple %lld
source: Delete %lld items immediately?
zh_hans: 立刻删除 %lld 个项目？

# alert.delete_immediately.single %@
source: Delete "%@" immediately?
zh_hans: 立刻删除「%@」？

# alert.delete_to_trash.message
source: Items will be moved to the Trash.
zh_hans: 项目将移至废纸篓。

# alert.empty_trash.message
source: All items in the Trash will be permanently deleted. This action cannot be undone.
zh_hans: 废纸篓中的所有项目将被永久删除，此操作无法撤销。

# alert.empty_trash.title
source: Empty Trash?
zh_hans: 清倒废纸篓？

# alert.open_with.choose_app %@
source: Choose an app to open "%@"
zh_hans: 选择用于打开「%@」的应用

# alert.open_with.prompt
source: Open
zh_hans: 打开

# alert.operation_failed
source: Operation Failed
zh_hans: 操作失败

# alert.put_back_failed.multiple %lld
source: %lld items could not be put back.
zh_hans: %lld 个项目无法放回原处。

# alert.put_back_failed.single %@
source: "%@" has no restore record and Finder cannot recover this item.
zh_hans: 「%@」没有可用的原始位置记录，且 Finder 无法恢复此项目。

# alert.put_back_failed.title
source: Cannot Put Back
zh_hans: 无法放回原处

# alert.selected_items %lld
source: %lld items selected
zh_hans: 已选择 %lld 个项目

# dialog.cannot_create_file
source: Cannot Create File
zh_hans: 无法创建文件

# dialog.cannot_create_file_message
source: Check whether the name is valid and the destination is writable.
zh_hans: 请检查名称是否合法，或目标位置是否可写。

# dialog.create
source: Create
zh_hans: 创建

# dialog.file_name_placeholder
source: File name
zh_hans: 文件名称

# dialog.folder_name_placeholder
source: Folder name
zh_hans: 文件夹名称

# dialog.new_file_message
source: Enter a name for the new file:
zh_hans: 输入新文件名称：

# dialog.new_file_title
source: New File
zh_hans: 新建文件

# dialog.new_folder_message
source: Enter a name for the new folder:
zh_hans: 输入新文件夹名称：

# dialog.new_folder_title
source: New Folder
zh_hans: 新建文件夹

# error.archive.empty_listing
source: Unable to read ZIP listing
zh_hans: 无法读取 ZIP 目录

# error.archive.timed_out
source: Listing read timed out
zh_hans: 目录读取超时

# error.default_viewer.defaults_command %lld
source: System command failed (exit code %lld).
zh_hans: 系统命令执行失败（退出码 %lld）。

# error.default_viewer.launch_services %lld
source: Launch Services registration failed (error %lld).
zh_hans: Launch Services 注册失败（错误码 %lld）。

# error.default_viewer.finder_not_found
source: Finder app not found.
zh_hans: 未找到 Finder 应用。

# error.default_viewer.preferences_sync
source: Unable to write system preferences.
zh_hans: 无法写入系统偏好设置。

# error.directory_not_found
source: Directory not found
zh_hans: 目录不存在

# error.empty_name
source: Name cannot be empty
zh_hans: 名称不能为空

# error.image.unable_to_encode
source: Unable to encode image
zh_hans: 无法编码图片

# error.image.unable_to_write
source: Unable to write file
zh_hans: 无法写入文件

# error.no_permission
source: Permission denied
zh_hans: 无权限

# error.shell.timed_out
source: Command timed out
zh_hans: 命令执行超时

# error.snippet_expansion.file_selection
source: A file (not a folder) must be selected
zh_hans: 需要选中一个文件（非目录）

# error.snippet_expansion.files_in_selection
source: At least one file must be selected
zh_hans: 需要选中至少一个文件

# error.snippet_expansion.no_files
source: No files in selection
zh_hans: 选中项中没有文件

# error.snippet_expansion.requires_selection
source: At least one item must be selected
zh_hans: 需要至少选中一项

# error.snippet_expansion.single_selection
source: Exactly one item must be selected
zh_hans: 需要恰好选中一项

# error.snippet_import.empty_content
source: Content is empty
zh_hans: 内容为空

# error.snippet_import.empty_name
source: Name is empty
zh_hans: 名称为空

# error.snippet_import.invalid %@
source: Invalid Snippet: %@
zh_hans: 无效 Snippet：%@

# error.snippet_import.invalid_format
source: Unrecognized Snippets file format
zh_hans: 无法识别的 Snippets 文件格式

# error.snippet_import.too_many
source: Too many items to import
zh_hans: 导入条目过多

# error.snippet_import.unsupported_schema
source: Unsupported file version
zh_hans: 不支持的文件版本

# error.symlink_loop
source: Symbolic link loop detected
zh_hans: 检测到循环链接

# folder.desktop
source: Desktop
zh_hans: 桌面

# folder.documents
source: Documents
zh_hans: 文稿

# folder.downloads
source: Downloads
zh_hans: 下载

# folder.home
source: Home
zh_hans: 个人

# info.access.executable
source: executable
zh_hans: 可执行

# info.access.label
source: Access:
zh_hans: 访问：

# info.access.readable
source: readable
zh_hans: 可读

# info.access.writable
source: writable
zh_hans: 可写

# info.created %@
source: Created: %@
zh_hans: 创建时间：%@

# info.hidden %@
source: Hidden: %@
zh_hans: 隐藏：%@

# info.hidden.label
source: Hidden:
zh_hans: 隐藏：

# info.kind.extension_file %@
source: Kind: %@ file
zh_hans: 种类：%@ 文件

# info.kind.file
source: Kind: File
zh_hans: 种类：文件

# info.kind.file_short
source: file
zh_hans: 文件

# info.kind.folder
source: Kind: Folder
zh_hans: 种类：文件夹

# info.kind.folder_short
source: folder
zh_hans: 文件夹

# info.location %@
source: Location: %@
zh_hans: 位置：%@

# info.modified %@
source: Modified: %@
zh_hans: 修改时间：%@

# info.no
source: No
zh_hans: 否

# info.path %@
source: Path: %@
zh_hans: 路径：%@

# info.path.label
source: Path:
zh_hans: 路径：

# info.permissions %@ %@
source: Permissions: %@ (%@)
zh_hans: 权限：%@（%@）

# info.size %@
source: Size: %@
zh_hans: 大小：%@

# info.type_identifier %@
source: Type identifier: %@
zh_hans: 类型标识：%@

# info.yes
source: Yes
zh_hans: 是

# menu.collapse_strip
source: Collapse Filmstrip
zh_hans: 收起胶片条

# menu.expand_strip
source: Expand Filmstrip
zh_hans: 展开胶片条

# menu.go
source: Go
zh_hans: 前往

# menu.export_snippets
source: Export All Snippets…
zh_hans: 导出全部 Snippets…

# menu.hide_output
source: Hide Output Panel
zh_hans: 关闭输出面板

# menu.hide_preview
source: Hide Preview
zh_hans: 关闭预览

# menu.hide_snippets
source: Hide Snippets
zh_hans: 关闭 Snippets

# menu.import_snippets
source: Import Snippets…
zh_hans: 导入 Snippets…

# menu.next_preview
source: Next Preview
zh_hans: 下一个预览

# menu.open_preview_detached
source: Open Preview in Separate Window
zh_hans: 在独立窗口中打开预览

# menu.previous_preview
source: Previous Preview
zh_hans: 上一个预览

# menu.reattach_preview
source: Move Preview Back to Sidebar
zh_hans: 收回预览到侧栏

# menu.show_output
source: Show Output Panel
zh_hans: 显示输出面板

# menu.show_preview
source: Show Preview
zh_hans: 显示预览

# menu.show_snippets
source: Show Snippets
zh_hans: 显示 Snippets

# menu.toggle_left_panel
source: Toggle Left Panel
zh_hans: 切换左侧面板

# menu.toggle_right_panel
source: Toggle Right Panel
zh_hans: 切换右侧面板

# pathbar.clear
source: Clear
zh_hans: 清除

# pathbar.commit
source: Go to path
zh_hans: 进入新路径

# pathbar.edit
source: Click to edit full path
zh_hans: 点击编辑完整路径

# pathbar.no_subdirs
source: No subfolders
zh_hans: 无子文件夹

# pathbar.parent
source: Show parent path
zh_hans: 显示上级路径

# pathbar.select_all
source: Click to select full path
zh_hans: 点击全选路径

# pathbar.subdirs
source: Show subdirectories
zh_hans: 显示子目录

# pathbar.back
source: Back
zh_hans: 后退

# pathbar.forward
source: Forward
zh_hans: 前进

# pathbar.history
source: Recent paths
zh_hans: 最近访问的路径

# permission.automation.message
source: MeoFind needs permission to control Finder to show Trash contents. In System Settings → Privacy & Security → Automation, allow MeoFind to control Finder.
zh_hans: MeoFind 需要「控制 Finder」的权限才能显示废纸篓内容。 请在「系统设置 → 隐私与安全性 → 自动化」中，允许 MeoFind 控制 Finder。

# permission.automation.open_settings
source: Open System Settings
zh_hans: 打开系统设置

# permission.automation.title
source: Automation Permission Required
zh_hans: 需要自动化权限

# permission.fda.detected
source: Full Disk Access detected. Restart the app to finish enabling it.
zh_hans: 已检测到完全磁盘访问权限，请重启应用以完成启用。

# permission.fda.later
source: Later
zh_hans: 稍后

# permission.fda.message
source: MeoFind needs this permission to browse all files and folders on your system.
zh_hans: MeoFind 需要此权限才能浏览系统中的全部文件与文件夹。

# permission.fda.not_detected
source: Permission not detected yet. Make sure this app is enabled in System Settings.
zh_hans: 尚未检测到权限。请确认已在系统设置中勾选本应用。

# permission.fda.open_settings
source: Open System Settings
zh_hans: 打开系统设置

# permission.fda.restart_app
source: Restart App
zh_hans: 重启应用

# permission.fda.step1
source: Click Open System Settings below.
zh_hans: 点击下方「打开系统设置」。

# permission.fda.step2 %@
source: In Privacy & Security → Full Disk Access, turn on %@.
zh_hans: 在「隐私与安全性 → 完全磁盘访问权限」中，打开 %@ 的开关。

# permission.fda.step3
source: Return to this app and click Restart App to apply the permission.
zh_hans: 返回本应用后，点击「重启应用」使权限生效。

# permission.fda.title
source: Full Disk Access Required
zh_hans: 需要完全磁盘访问权限

# preview.archive_truncated
source: [Truncated...]
zh_hans: [已截断…]

# preview.chrome.back_to_folder
source: Back to Folder
zh_hans: 返回文件夹

# preview.chrome.close_preview
source: Close Preview
zh_hans: 关闭预览

# preview.chrome.close_window
source: Close Window
zh_hans: 关闭窗口

# preview.chrome.collapse
source: Collapse Preview
zh_hans: 折叠预览

# preview.chrome.detach
source: Open in Detached Window
zh_hans: 在独立窗口中打开

# preview.chrome.dock_back
source: Dock to Sidebar
zh_hans: 收回侧栏

# preview.chrome.expand
source: Expand Preview
zh_hans: 展开预览

# preview.close
source: Close Preview
zh_hans: 关闭预览

# preview.collapse
source: Collapse Preview
zh_hans: 折叠预览

# preview.detached_placeholder %@
source: %@ is being previewed in a separate window
zh_hans: %@ 已在独立窗口中预览

# preview.dock_back
source: Move Back to Sidebar
zh_hans: 收回侧栏

# preview.empty_state
source: Select a file to preview
zh_hans: 选择文件以预览

# preview.error_loading
source: Error Loading Preview
zh_hans: 预览加载失败

# preview.expand
source: Expand Preview
zh_hans: 展开预览

# preview.focus_window
source: Focus Window
zh_hans: 聚焦窗口

# preview.image.confirm
source: OK
zh_hans: 确定

# preview.image.height
source: Height
zh_hans: 高度

# preview.image.maintain_aspect
source: Maintain Aspect Ratio
zh_hans: 保持宽高比

# preview.image.resize_hint
source: Set output size in pixels. After confirming, click Save Edits to write the file.
zh_hans: 按像素设置输出尺寸。确认后需点击「保存编辑结果」写入文件。

# preview.image.resize_title
source: Resize Image
zh_hans: 调整图片尺寸

# preview.image.validation.empty
source: Enter width and height
zh_hans: 请输入宽度和高度

# preview.image.validation.invalid
source: Enter valid pixel values
zh_hans: 请输入有效的像素数值

# preview.image.validation.max
source: Each side cannot exceed 65535 pixels
zh_hans: 单边像素不能超过 65535

# preview.image.validation.positive
source: Width and height must be greater than 0
zh_hans: 宽度和高度必须大于 0

# preview.image.width
source: Width
zh_hans: 宽度

# preview.loading
source: Loading preview...
zh_hans: 正在加载预览…

# preview.next
source: Next
zh_hans: 下一个

# preview.not_available
source: Preview not available for this file type
zh_hans: 无法预览此文件类型

# preview.previous
source: Previous
zh_hans: 上一个

# preview.reattach.confirm
source: Move Back
zh_hans: 收回

# preview.reattach.message
source: Moving the preview back will replace the current sidebar preview. Continue?
zh_hans: 收回将替换侧栏当前预览。是否继续？

# preview.reattach.title
source: Move Preview Back
zh_hans: 收回预览

# preview.save_failed_title
source: Save Failed
zh_hans: 保存失败

source: Preview session closed
zh_hans: 预览会话已关闭

# preview.title
source: Preview
zh_hans: 预览

# preview.toolbar.actual_size
source: Actual Size
zh_hans: 原始大小

# preview.toolbar.archive_collapse
source: Collapse to Top Level
zh_hans: 折叠到第一层

# preview.toolbar.archive_expand
source: Expand All Levels
zh_hans: 展开到全部层级

# preview.toolbar.color_hex %@
source: Color %@
zh_hans: 颜色 %@

# preview.toolbar.color_picker
source: Color Picker (click image to copy Web color)
zh_hans: 取色棒（点击图像复制 Web 颜色）

# preview.toolbar.copied_to_clipboard
source: Copied to Clipboard
zh_hans: 已复制到剪贴板

# preview.toolbar.copy_all
source: Copy All
zh_hans: 复制全文

# preview.toolbar.copy_image
source: Copy Image
zh_hans: 复制图片

# preview.toolbar.copy_manifest
source: Copy Manifest
zh_hans: 复制清单

# preview.toolbar.eyedropper
source: Eyedropper
zh_hans: 取色棒

# preview.toolbar.fit_page
source: Fit Page
zh_hans: 整页适配

# preview.toolbar.fit_width
source: Fit Width
zh_hans: 适配宽度

# preview.toolbar.fit_window
source: Fit Window
zh_hans: 适配窗口

# preview.toolbar.flip_horizontal
source: Flip Horizontal
zh_hans: 水平翻转

# preview.toolbar.flip_vertical
source: Flip Vertical
zh_hans: 垂直翻转

# preview.toolbar.font_size
source: Font Size
zh_hans: 字体大小

# preview.toolbar.html_preview
source: HTML Parsed Preview
zh_hans: HTML 解析预览

# preview.toolbar.jump_bottom
source: Jump to Bottom
zh_hans: 跳转底部

# preview.toolbar.jump_to_page
source: Go to Page
zh_hans: 跳转到页码

# preview.toolbar.jump_top
source: Jump to Top
zh_hans: 跳转顶部

# preview.toolbar.markdown_to_preview
source: Switch to Preview Mode
zh_hans: 切换为预览模式

# preview.toolbar.markdown_to_source
source: Switch to Source Mode
zh_hans: 切换为源码模式

# preview.toolbar.more_actions
source: More Actions
zh_hans: 更多操作

# preview.toolbar.mute
source: Mute
zh_hans: 静音

# preview.toolbar.next_match
source: Next
zh_hans: 下一个

# preview.toolbar.next_page
source: Next Page
zh_hans: 下一页

# preview.toolbar.open_default_app
source: Open with Default App
zh_hans: 用默认应用打开

# preview.toolbar.page_number
source: Page Number
zh_hans: 页码

# preview.toolbar.pause
source: Pause
zh_hans: 暂停

# preview.toolbar.play
source: Play
zh_hans: 播放

# preview.toolbar.previous_page
source: Previous Page
zh_hans: 上一页

# preview.toolbar.refresh_listing
source: Refresh Listing
zh_hans: 刷新目录

# preview.toolbar.reset
source: Reset
zh_hans: 还原

# preview.toolbar.reset_view
source: Reset View
zh_hans: 重置视图

# preview.toolbar.resize
source: Resize
zh_hans: 调整尺寸

# preview.toolbar.rotate_ccw
source: Rotate Counterclockwise
zh_hans: 逆时针旋转

# preview.toolbar.rotate_cw
source: Rotate Clockwise
zh_hans: 顺时针旋转

# preview.toolbar.save_edits
source: Save Edits
zh_hans: 保存编辑结果

# preview.toolbar.search_in_preview
source: Search in Preview
zh_hans: 在预览中搜索

# preview.toolbar.search_prompt
source: Search
zh_hans: 搜索

# preview.toolbar.source_mode
source: Source Mode
zh_hans: 源码模式

# preview.toolbar.undo
source: Undo Last Step
zh_hans: 撤销上一步

# preview.toolbar.unmute
source: Unmute
zh_hans: 取消静音

# preview.toolbar.wrap_disable
source: Disable Word Wrap
zh_hans: 关闭自动换行

# preview.toolbar.wrap_enable
source: Enable Word Wrap
zh_hans: 开启自动换行

# preview.toolbar.zoom
source: Zoom
zh_hans: 缩放

# preview.toolbar.zoom_in
source: Zoom In
zh_hans: 放大

# preview.toolbar.zoom_in_font
source: Increase Font Size
zh_hans: 放大字体

# preview.toolbar.zoom_in_overall
source: Zoom In (Overall)
zh_hans: 放大（整体）

# preview.toolbar.zoom_out
source: Zoom Out
zh_hans: 缩小

# preview.toolbar.zoom_out_font
source: Decrease Font Size
zh_hans: 缩小字体

# preview.toolbar.zoom_out_overall
source: Zoom Out (Overall)
zh_hans: 缩小（整体）

# preview.toolbar.zoom_scale
source: Zoom Level
zh_hans: 缩放比例

# search.close_quick_search
source: Close Quick Search
zh_hans: 关闭快速搜索

# search.focus
source: Focus Search
zh_hans: 聚焦搜索

# search.prompt
source: Search files
zh_hans: 搜索文件

# search.quick_search
source: Quick Search
zh_hans: 快速搜索

# remote_server.address_prompt
source: Server Address
zh_hans: 服务器地址

# remote_server.connect
source: Connect
zh_hans: 连接

# remote_server.connect_server_menu
source: Connect to Server…
zh_hans: 连接服务器…

# remote_server.connecting
source: Connecting…
zh_hans: 正在连接…

# remote_server.disconnected_from_server
source: Disconnected from the server
zh_hans: 已断开与服务器的连接

# remote_server.ftp_security_notice
source: FTP transfers data in plain text. Use SMB for sensitive files.
zh_hans: FTP 为明文传输，敏感数据请改用 SMB。

# remote_server.recent_title
source: Recent Connections
zh_hans: 最近连接

# remote_server.remove_from_recent
source: Remove from Recent
zh_hans: 从最近连接中移除

# remote_server.sheet.title
source: Connect to Server
zh_hans: 连接服务器

# remote_server.supported_protocols
source: Supported: SMB · NFS · WebDAV · FTP
zh_hans: 支持：SMB · NFS · WebDAV · FTP

# remote_server.error.ambiguous_new_volumes
source: Multiple new volumes were mounted. Opened the first one.
zh_hans: 检测到多个新挂载卷，已打开第一个。

# remote_server.error.invalid_url
source: Unrecognized server address. Use smb://, ftp://, nfs://, or https://.
zh_hans: 无法识别服务器地址，请使用 smb://、ftp://、nfs:// 或 https:// 格式。

# remote_server.error.mount_failed %@
source: Could not connect to the server: %@
zh_hans: 无法连接服务器：%@

# remote_server.error.sftp_deferred
source: SFTP will be supported in a future release. Use SMB, or mount with sshfs first.
zh_hans: SFTP 将在后续版本支持；当前请使用 SMB，或通过 sshfs 挂载后再浏览。

# remote_server.error.timeout
source: Connection timed out. Check the network or server availability.
zh_hans: 连接超时，请检查网络或服务器是否可用。

# remote_server.error.unsupported_protocol %@
source: The %@ protocol is not supported.
zh_hans: 不支持 %@ 协议。

# settings.auto_show_output
source: Auto-show Output Panel on Shell Run
zh_hans: Shell 执行时自动展开输出面板

# settings.blank_action.parent
source: Go to parent folder
zh_hans: 返回上级目录

# settings.blank_action.terminal
source: Open Terminal here
zh_hans: 在本目录打开终端

# settings.blank_double_click
source: Double-click on blank area
zh_hans: 空白处双击

# settings.confirm_destructive
source: Confirm Destructive Commands
zh_hans: 危险命令二次确认

# settings.default_viewer.current
source: Current Default
zh_hans: 当前默认

# settings.default_viewer.restart_hint
source: Log out and back in, or restart your Mac, for changes to take effect everywhere.
zh_hans: 更改后请注销并重新登录，或重启 Mac，才能在全部场景中生效。

# settings.default_viewer.restore_finder
source: Restore Finder
zh_hans: 恢复 Finder

# settings.default_viewer.set
source: Set as Default Folder Viewer
zh_hans: 设为默认文件夹查看器

# settings.default_viewer.title
source: Default Folder Viewer
zh_hans: 默认文件夹查看器

# settings.general.interface_language
source: Interface Language
zh_hans: 界面语言

# settings.general.interface_language_footer
source: Applies immediately to most of the app. Restart MeoFind if menu bar items look unchanged.
zh_hans: 大部分界面会立即切换。若菜单栏未更新，请重启 MeoFind。

# settings.job_concurrency_limit %lld
source: Job Concurrency Limit: %lld
zh_hans: Job 并发上限：%lld

# settings.pin_recent_snippets
source: Pin Recently Executed
zh_hans: 最近执行置顶

# settings.preview.add_rule
source: Add Rule…
zh_hans: 添加规则…

# settings.preview.add_rule_title
source: Add Preview Rule
zh_hans: 添加预览规则

# settings.preview.builtin_catalog
source: Built-in Preview Types (Read-only)
zh_hans: 内置预览类型（只读）

# settings.preview.code_line_numbers
source: Code Preview
zh_hans: 代码预览

# settings.preview.code_line_numbers.footer
source: When enabled, line numbers appear to the left of code in the sidebar preview panel.
zh_hans: 开启后，在右侧预览面板查看代码文件时，于代码左侧显示行号。

# settings.preview.code_line_numbers.toggle
source: Show line numbers in code preview
zh_hans: 代码预览显示行号

# settings.preview.custom_types
source: Custom File Types
zh_hans: 自定义文件类型

# settings.preview.detached_browse
source: Browse in Detached Window
zh_hans: 独立窗口浏览

# settings.preview.detached_browse.footer
source: When enabled, the filmstrip and ← → navigation in a detached preview window only switch between files of the same type.
zh_hans: 开启后，弹出预览窗口时胶片条与 ← → 导航仅在同类型文件间切换。

# settings.preview.detached_browse.toggle
source: Show only same extension in detached browser strip
zh_hans: 独立窗口浏览条仅显示同扩展名

# settings.preview.disabled
source: Disabled
zh_hans: 已禁用

# settings.preview.edit_rule_title
source: Edit Preview Rule
zh_hans: 编辑预览规则

# settings.preview.enabled_toggle
source: Enabled
zh_hans: 启用

# settings.preview.export_panel_title
source: Export Custom Preview Rules
zh_hans: 导出自定义预览规则

# settings.preview.export_rules
source: Export Rules…
zh_hans: 导出规则…

# settings.preview.export_success %lld
source: Exported %lld rules.
zh_hans: 已导出 %lld 条规则。

# settings.preview.extensionless_label
source: (no extension)
zh_hans: （无扩展名）

# settings.preview.extensions_field
source: Extensions (comma-separated)
zh_hans: 扩展名（逗号分隔）

# settings.preview.import.merge
source: Merge
zh_hans: 合并

# settings.preview.import.replace
source: Replace
zh_hans: 替换

# settings.preview.import_complete
source: Import complete.
zh_hans: 导入完成。

# settings.preview.import_export_title
source: Import / Export
zh_hans: 导入 / 导出

# settings.preview.import_method_message
source: Merge keeps existing rules and updates matching IDs. Replace clears all existing rules.
zh_hans: 合并会保留现有规则并更新同 ID 条目；替换会清空现有规则。

# settings.preview.import_method_title
source: Import Method
zh_hans: 导入方式

# settings.preview.import_panel_title
source: Import Custom Preview Rules
zh_hans: 导入自定义预览规则

# settings.preview.import_rules
source: Import Rules…
zh_hans: 导入规则…

# settings.preview.mode.html
source: HTML Preview
zh_hans: HTML 预览

# settings.preview.mode.html.detail
source: Render HTML in WebKit; source view can be toggled.
zh_hans: 在 WebKit 中渲染 HTML；可切换源码视图。

# settings.preview.mode.image
source: Image Preview
zh_hans: 图片预览

# settings.preview.mode.image.detail
source: Decode and display as an image when possible.
zh_hans: 尝试按图片解码并显示。

# settings.preview.mode.markdown
source: Markdown Preview
zh_hans: Markdown 预览

# settings.preview.mode.markdown.detail
source: Render Markdown; source view can be toggled in the toolbar.
zh_hans: 渲染 Markdown；可在顶栏切换源码视图。

# settings.preview.mode.media
source: Media Preview
zh_hans: 媒体预览

# settings.preview.mode.media.detail
source: Play audio and video with AVPlayer.
zh_hans: 使用 AVPlayer 播放音视频。

# settings.preview.mode.pdf
source: PDF Preview
zh_hans: PDF 预览

# settings.preview.mode.pdf.detail
source: Display PDF documents with PDFKit.
zh_hans: 使用 PDFKit 显示 PDF 文档。

# settings.preview.mode.quicklook
source: QuickLook Preview
zh_hans: QuickLook 预览

# settings.preview.mode.quicklook.detail
source: Use macOS QuickLook for formats supported by the system.
zh_hans: 使用 macOS QuickLook，适合系统已支持预览的格式。

# settings.preview.mode.text
source: Text Preview
zh_hans: 文本预览

# settings.preview.mode.text.detail
source: Display as plain text with syntax highlighting by extension.
zh_hans: 以纯文本显示，并根据扩展名做语法高亮。

# settings.preview.no_rules_hint
source: No custom rules yet. Select an unpreviewable file to add one from the preview panel.
zh_hans: 尚未添加自定义规则。选中无法预览的文件时，可直接在预览面板一键添加。

# settings.preview.open_in_settings
source: Customize in Settings…
zh_hans: 在设置中自定义…

# settings.preview.override_builtin
source: Override Built-in
zh_hans: 覆盖内置

# settings.preview.override_builtin_toggle
source: Override built-in preview
zh_hans: 覆盖内置预览

# settings.preview.preview_as_text
source: Preview as Text
zh_hans: 以文本预览
